from django.core.management.base import BaseCommand
from apply.models import Subject_code, Major, Department

class Command(BaseCommand):
    help = 'Save major data to the database'

    def handle(self, *args, **options):
        # 주어진 데이터
        code_data = {
            '502241': '국어국문학전공',
            '502242': '일어일문학전공',
            '502243': '중어중문학전공',
            '502388': '중어중문학전공',
            '502387': '영어영문학전공',
            '502245': '영어영문학전공',
            '502246': '불어불문학전공',
            '502247': '불어불문학전공',
            '502248': '독어독문학전공',
            '502407': '독어독문학전공',
            '502251': '스페인어전공',
            '502252': '사학전공',
            '502253': '사학전공',
            '502254': '철학전공',
            '502255': '철학전공',
            '502257': '미술사학전공',
            '502256': '미술사학전공',
            '502258': '문화인류학전공',
            '502259': '경영학전공',
            '502260': '경영학전공',
            '502831': '회계학전공',
            '502263': '국제통상학전공',
            '502264': '법학전공',
            '502265': '사회학전공',
            '502266': '사회학전공',
            '502267': '문헌정보학전공',
            '502268': '심리학전공',
            '502269': '아동가족학전공',
            '502270': '아동가족학전공',
            '502271': '사회복지학전공',
            '502272': '정치외교학전공',
            '502273': '의상디자인전공',
            '502274': '의상디자인전공',
            '502289': '바이오공학전공',
            '502290': '바이오공학전공',
            '502878': '디지털소프트웨어전공',
            '502927': '디지털소프트웨어전공',
            '502854': '디지털소프트웨어전공',
            '502275': '수학전공',
            '502276': '정보통계학전공',
            '502277': '화학전공',
            '502278': '화학전공',
            '502279': '식품영양학전공',
            '502280': '식품영양학전공',
            '502832': '생활체육학전공',
            '502281': '생활체육학전공',
            '502291': '동양화전공',
            '502292': '동양화전공',
            '502293': '서양화전공',
            '502294': '서양화전공',
            '502295': '실내디자인전공',
            '502296': '실내디자인전공',
            '502297': '시각디자인전공',
            '502298': '시각디자인전공',
            '502299': '텍스타일디자인전공',
            '502300': '텍스타일디자인전공',
        }
    
        maximum_data = {
            '국어국문학전공': 35,
            '일어일문학전공': 37,
            '중어중문학전공': 46,
            '영어영문학전공': 42,
            '불어불문학전공': 18,
            '독어독문학전공': 18,
            '스페인어전공': 17,
            '사학전공': 18,
            '철학전공': 18,
            '미술사학전공': 25,
            '문화인류학전공': 19,
            '경영학전공': 40,
            '회계학전공': 39,
            '국제통상학전공': 41,
            '법학전공': 26,
            '사회학전공': 18,
            '문헌정보학전공': 30,
            '심리학전공': 48,
            '아동가족학전공': 20,
            '사회복지학전공': 31,
            '정치외교학전공': 30,
            '의상디자인전공': 39,
            '바이오공학전공': 32,
            '디지털소프트웨어전공': 142,
            '수학전공': 36,
            '정보통계학전공': 36,
            '화학전공': 36,
            '식품영양학전공': 58,
            '생활체육학전공': 25,
            '동양화전공': 18,
            '서양화전공': 19,
            '실내디자인전공': 20,
            '시각디자인전공': 20,
            '텍스타일디자인전공': 19,
        }

        for major_name, maximum in maximum_data.items():
                # Department 이름 추출
                if major_name in ['국어국문학전공', '일어일문학전공', '중어중문학전공', '영어영문학전공', '불어불문학전공', '독어독문학전공', '스페인어전공', '사학전공', '철학전공', '미술사학전공', '문화인류학전공', '경영학전공', '회계학전공', '국제통상학전공', '법학전공', '사회학전공', '문헌정보학전공', '심리학전공', '아동가족학전공', '사회복지학전공', '정치외교학전공', '의상디자인전공']:
                    department_name = '글로벌융합대학'
                elif major_name in ['디지털소프트웨어전공', '바이오공학전공', '생활체육학전공', '식품영양학전공', '정보통계학전공', '화학전공', '수학전공']:
                    department_name = '과학기술대학'
                elif major_name in ['동양화전공', '서양화전공', '실내디자인전공', '시각디자인전공', '텍스타일디자인전공']:
                    department_name = 'Art&Design대학'

                # Department 객체 가져오기 또는 생성
                department, created = Department.objects.get_or_create(department_name=department_name)

                # Major 객체 가져오기 또는 생성
                major, created = Major.objects.get_or_create(major_name=major_name, department=department, maximum=maximum)
                
                for subject_code, major_name2  in code_data.items():
                    if major_name2 == major_name:
                        # Subject_code 모델에 인스턴스 생성
                        subject_code_instance = Subject_code.objects.create(code=subject_code, major=major)

        self.stdout.write(self.style.SUCCESS('Major data saved successfully'))